#4) შექმენით 30 მაგალითი შედარების ოპერაციებზე (>, <, >=, <=, ==, !=), გამოიყენეთ სხვადასხვა ტიპის მნიშვნელობები (რიცხვები, სტრინგები, ცვლადები). თითოეულ მაგალითში კომენტარით მიუწერეთ, რას აბრუნებს (True ან False) და რატომ მაგალითად, თუ ობიექტები განსხვავებული ტიპისაა, ახსენით როგორ იქნა შედარებული. ეცადეთ, რომ მაგალითები არ გამეორდეს და მოიცავდეს სხვადასხვა სიტუაციებს (მათ შორის ცვლადების გამოყენებასაც)

sara = 15 == 15  # True რიცხვები ტოლია
num1 = 10 == 5  # False რიცხვები განსხვავებულია
balance = 26 == 26  # True რიცხვები ტოლია
name = "Zaza" == "Zaza"  # True ტექსტები ერთნაირია
book = "Python" == "HTML"  # False ტექსტები განსხვავებულია

number = 15 != 15  # False რიცხვები ტოლია
price = 20 != 10  # True რიცხვები განსხვავებულია
score = 7 != 3  # True რიცხვები განსხვავებულია
city = "Tbilisi" != "Batumi"  # True ტექსტები განსხვავებულია
game = "Roblox" != "Roblox"  # False ტექსტები ერთნაირია

a = 5 <= 10  # True 5 ნაკლებია 10-ზე
b = 15 <= 3  # False 15 მეტია 3-ზე
c = 8 <= 8  # True რიცხვები ტოლია
d = 2.5 <= 5  # True 2.5 ნაკლებია 5-ზე
e = 20 <= 10  # False 20 მეტია 10-ზე

f = 15 > 10  # True 15 მეტია 10-ზე
g = 3 > 15  # False 3 ნაკლებია 15-ზე
h = 8 > 8  # False რიცხვები ტოლია
i = 25 > 9  # True 25 მეტია 9-ზე
j = 4 > 12  # False 4 ნაკლებია 12-ზე

k = 5 < 10  # True 5 ნაკლებია 10-ზე
l = 20 < 3  # False 20 მეტია 3-ზე
m = 7 < 7  # False რიცხვები ტოლია
n = 4 < 8  # True 4 ნაკლებია 8-ზე
o = 4.5 < 8  # True 4.5 ნაკლებია 8-ზე

p = 15 >= 10  # True 15 მეტია 10-ზე
q = 5 >= 10  # False 5 ნაკლებია 10-ზე
r = 8 >= 8  # True რიცხვები ტოლია
s = 12.5 >= 10  # True 12.5 მეტია 10-ზე
t = 20 >= 25  # False 20 ნაკლებია 25-ზე